Revit 2027 API
ViewSchedule.HasStripedRows Property
 Indicates whether this schedule has striped rows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasStripedRows { get; set; }
Public Property HasStripedRows As Boolean
	Get
	Set
public:
property bool HasStripedRows {
	bool get ();
	void set (bool value);
}
member HasStripedRows : bool with get, set
Property Value
Boolean
Remarks
 Striped rows can be overridden by shading or conditional formatting.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace